Торговля_11__демо/src/InformationRegisters/НастройкиИнтеграцииСПлатежнымиСистемамиУТ/НастройкиИнтеграцииСПлатежнымиСистемамиУТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииСПлатежнымиСистемамиУТ</name>
  <resources>
    <name>Интеграция</name>
    <type>
      <types>CatalogRef.НастройкиИнтеграцииСПлатежнымиСистемами</types>
    </type>
  </resources>
  <resources>
    <name>ПлатежнаяСистема</name>
    <type>
      <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/НастройкиИнтеграцииСПлатежнымиСистемамиУТ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений с действующими договорами и их настройками интеграции.
//
// Возвращаемое значение:
//	ТаблицаЗначений:
//		*Договор - СправочникСсылка.ДоговорыЭквайринга - 
//		*Интеграция - СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами -
//
Функция ДействующиеДоговораСНастройкамиИнтеграции() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор КАК Договор,
	               |	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция КАК Интеграция
	               |ИЗ
	               |	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	               |ГДЕ
	               |	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	               |	И НЕ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = ЗНАЧЕНИЕ(Справочник.НастройкиИнтеграцииСПлатежнымиСистемами.ПустаяСсылка)";
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

#КонецОбласти

#КонецЕсли
